/*
 * Encoder.c
 *
 *  Created on: 5 авг. 2022 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "Encoder.h"

//*******************************************************************************************
//*******************************************************************************************
static uint32_t encoderConstant = 0;
static uint32_t encoderState    = 0;


//*******************************************************************************************
//*******************************************************************************************
static uint32_t _encoder_GrayToBin(uint32_t grayCode){

	grayCode ^= grayCode >> 1;
	grayCode ^= grayCode >> 2;
	grayCode ^= grayCode >> 4;
	grayCode ^= grayCode >> 8;
	grayCode ^= grayCode >> 16;
	return grayCode;
}
//*******************************************************************************************
//*******************************************************************************************
void ENCODER_Init(void){

	SPI_Init(ENCODER_SPI);
	encoderState = ENCODER_READY;
}
//**********************************************************
//Получение значение поворота энкодера.
uint32_t ENCODER_GetVal(void){

	if(encoderState == ENCODER_NO_INIT) return 0;
	//Чтение и выравнивание данных из энкодера.
	uint32_t encoderVal = (SPI_Rx3Byte(ENCODER_SPI) >> 6) & 0x0001FFFF; //Разрешения энкодера 17 бит.
	return _encoder_GrayToBin(encoderVal);                            	//Преобразование кода Грея в двоичный код.
}
//**********************************************************




//**********************************************************
void ENCODER_SetEncoderConstant(uint32_t value){

	encoderConstant = value;
}
//**********************************************************
uint32_t ENCODER_GetEncoderConstant(void){

	return encoderConstant;
}
//**********************************************************
void ENCODER_GetEncoderPosition(uint8_t *buf){

	uint32_t encoder = ENCODER_GetVal();

	buf[0] = (uint8_t) encoder;
	buf[1] = (uint8_t)(encoder >> 8);
	buf[2] = (uint8_t)(encoder >> 16);
	buf[3] = (uint8_t)(encoder >> 24);
}
//**********************************************************


//*******************************************************************************************
//*******************************************************************************************




