/*
 * Opticsensors.c
 *
 *  Created on: 10 авг. 2022 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "OpticSensors.h"

//*******************************************************************************************
//*******************************************************************************************


//*******************************************************************************************
//*******************************************************************************************
void OPT_SENS_Init(void){

	GPIO_InitForOutputPushPull(SENS_LED_GPIO_PORT, SENS_LED_GPIO_PIN);   //SENS_LED    - PB6 - выход
	GPIO_InitForInputPullUp(SENS_LENS_E_GPIO_PORT, SENS_LENS_E_GPIO_PIN);//SENS_LENS_E - PB3 - вход
	GPIO_InitForInputPullUp(SENS_BAT_E_GPIO_PORT,  SENS_BAT_E_GPIO_PIN); //SENS_BAT_E  - PB4 - вход
}
//**********************************************************
/*
 * Опрос оптических датчиков. Алгоритм такой:
 * 1 - излучющий диод выключен.
 * 2 - смотрим засвечен датчик или нет.
 * Если засвечен - значит крышка снята и датчик освещен сторонним источником света.
 * Если не засвечен - значит крышка надета, либо крышка снята в темном помещении.
 *
 */
void OPT_SENS_CheckLoop(void){

//	static uint32_t msCountForLed  = 0;
//	static uint32_t msCountForSens = 0;
	//-------------------
//	if(!GPIO_GetPinState(SENS_LENS_E_GPIO_PORT, SENS_LENS_E_GPIO_PIN))
//	{
//		LED_ACT_High();
//	}
//	else LED_ACT_Low();
}
//**********************************************************
uint32_t OPT_SENS_GetState(uint32_t sens){

	return 0;
}
//**********************************************************

//*******************************************************************************************
//*******************************************************************************************





