/*
 * Opticsensors.c
 *
 *  Created on: 10 авг. 2022 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "OpticSensors.h"

//*******************************************************************************************
//*******************************************************************************************
static uint32_t optSensState = 0;

//*******************************************************************************************
//*******************************************************************************************
void OPT_SENS_Init(void){

	//SENS_LED    - PB6 - выход
	GPIOB->CRL &= ~(GPIO_CRL_CNF6);//выход, режим - push-pull.
	GPIOB->CRL |=   GPIO_CRL_MODE6;//тактирование 50МГц.

	//SENS_LENS_E - PB3 - вход

	//SENS_BAT_E  - PB4 - вход

}
//**********************************************************
/*
 * Опрос оптических датчиков. Алгоритм такой:
 * 1 - излучющий диод выключен.
 * 2 - смотрим засвечен датчик или нет.
 * Если засвечен - значит крышка снята и датчик освещен сторонним источником света.
 * Если не засвечен - значит крышка надета, либо крышка снята в темном помещении.
 *
 */
void OPT_SENS_CheckLoop(void){

//	static uint32_t msCountForLed  = 0;
//	static uint32_t msCountForSens = 0;
	//-------------------



}
//**********************************************************
uint32_t OPT_SENS_GetState(uint32_t sens){

	return 0;
}
//**********************************************************

//*******************************************************************************************
//*******************************************************************************************





