/*
 * Power.h
 *
 *  Created on: 30 авг. 2022 г.
 *      Author: belyaev
 */

#ifndef MCUV7_POWER_H
#define MCUV7_POWER_H
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define ADC_DC_IN_DIV_CH	8		//Канал АЦП

#define DIVIDER_RES_HIGH	10000	//Сопротивление верхнего резистора делителя, в Омах
#define DIVIDER_RES_LOW		1000	//Сопротивление нижнего резистора делителя, в Омах
#define DIVISION_FACTOR		((DIVIDER_RES_HIGH/DIVIDER_RES_LOW) + 1)//коэффициент деления елителя

#define SUPPLY_VOLTAGE_MIN		10800	//Минимально напряжение питания, в мВ
#define SUPPLY_VOLTAGE_WARNING	12000	//Напряжение при котором нужно обратить внимание на заряд АКБ, в мВ.

//*******************************************************************************************
//*******************************************************************************************
void	 POWER_Init(void);
uint32_t POWER_GetSupplyVoltage(void);

//*******************************************************************************************
//*******************************************************************************************
#endif /* MCUV7_POWER_H_ */
