/*
 * Protocol_I2C.h
 *
 *  Created on: 22 авг. 2022 г.
 *      Author: belyaev
 */
#ifndef MCUV7_PROTOCOL_I2C_H
#define MCUV7_PROTOCOL_I2C_H
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
//Структура буфера.




//****************************************************
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef union{
	struct{
	//--------------------
	//Заголовок пакета.
	uint8_t  CmdCode;    	// Код команды.
	uint8_t  Count;       	// Размер блока.
	uint8_t	 Payload[62];	// Данные
	//--------------------
	}Pack;
	uint8_t bufForRx[62+2];
}MCU_RequestPack_t;
#pragma pack(pop)//вернули предыдущую настройку.
//****************************************************
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef union{
	struct{
	//--------------------
	//Заголовок пакета.
	uint8_t  Count;       	// Размер блока.
	uint8_t  CmdCode;    	// Код команды.
	uint8_t	 Payload[62];	// Данные
	//--------------------
	}Pack;
	uint8_t bufForTx[62+2];
}MCU_ResponsePack_t;
#pragma pack(pop)//вернули предыдущую настройку.
//*******************************************************************************************
//*******************************************************************************************




//*******************************************************************************************
//*******************************************************************************************
#endif /* MCUV7_PROTOCOL_I2C_H */



