/*
 * Delay.h
 *
 *  Created on: 20 дек. 2020 г.
 *      Author: Zver
 */

#ifndef DELAY_H_
#define DELAY_H_
//*******************************************************************************************
//*******************************************************************************************

//#include "main.h"
#include "stm32f103xb.h"

//*******************************************************************************************
//*******************************************************************************************
#define SYS_CORE_CLOCK     72000000U
#define TACTS_FOR_MICROSEC (SYS_CORE_CLOCK/1000000U)
#define MAX_DELAY_SEC		58	//макс. задержка 58 сек.
								//Через 59 сек. происходит переполнение DWT->CTRL.
#define MAX_DELAY_uS		(MAX_DELAY_SEC * 1000 * 1000)
//*******************************************************************************************
//*******************************************************************************************
void msDelay_Loop(void);
void msDelay(volatile uint32_t del);

void 	 DELAY_Init(void);
uint32_t DELAY_microSecCount(void);
void 	 DELAY_microS(uint32_t microSec);
void	 DELAY_milliS(uint32_t milliSec);
//*******************************************************************************************
//*******************************************************************************************
#endif /* DELAY_H_ */







