/*
 * Buttons.c
 *
 *  Created on: 17 авг. 2022 г.
 *      Author: belyaev
 */

//*******************************************************************************************
//*******************************************************************************************

#include <Buttons.h>

//*******************************************************************************************
//*******************************************************************************************


//*******************************************************************************************
//*******************************************************************************************


//*******************************************************************************************
//*******************************************************************************************
void BUTTON_Init(Button_t *btn){

	STM32_GPIO_InitForInputPullUp(btn->GPIO_PORT, btn->GPIO_PIN);
}
//**********************************************************
ButtonState_t BUTTON_GetState(Button_t *btn){

	//ButtonState_t btnStateTemp = btn->State;
	//btn->State = BUTTON_RELEASE;
	//return btnStateTemp;

	return btn->State;
}
//**********************************************************
void BUTTON_CheckLoop(Button_t *btn){

	static uint32_t msCount 	 		  = 0;
	static uint32_t timeoutLongPressCount = 0;
		   uint32_t btnPinState = STM32_GPIO_GetPinState(btn->GPIO_PORT, btn->GPIO_PIN);
	//---------------------
	//Опрос каждые 10 мСек
	if(++msCount >= 10)
	{
		msCount = 0;

		//Кнопка нажата.
		if(btnPinState == GPIO_PIN_LOW)
		{
			//Отсчитываем таймаут долгово нажатия(1,5с).
			if(++timeoutLongPressCount >= 150)
			{
				//timeoutLongPressCount = 0;
				btn->State = BUTTON_LONG_PRESS;
			}
			//Во время таймаута долгово нажатия кнопка была отпущена
			else
			{
				timeoutLongPressCount = 0;
				btn->State = BUTTON_CLICK;
			}
		}
		//Кнопка отпущена
		else
		{
			btn->State = BUTTON_RELEASE;
		}
	}
}
//*******************************************************************************************
//*******************************************************************************************




