/*
 * Delay.c
 *
 *  Created on: 20 дек. 2020 г.
 *      Author: Zver
 */
//*******************************************************************************************
//*******************************************************************************************

#include "Delay.h"

//*******************************************************************************************
static volatile uint32_t msCounter = 0;
//*******************************************************************************************
//*******************************************************************************************
void msDelay_Loop(void){

	msCounter++;
}
//**********************************************************
void msDelay(volatile uint32_t del){

	msCounter = 0;
	while(msCounter < del){__NOP();};
}
//*******************************************************************************************
//*******************************************************************************************
//Микросекундная задержка.
#define SYS_CORE_CLOCK     72000000U
#define TACTS_FOR_MICROSEC (SYS_CORE_CLOCK/1000000U)

//**********************************************************
void DELAY_Init(void){

	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk; // разрешаем использовать счётчик
	DWT->CYCCNT       = 0;						    // сброс счетчика
	DWT->CTRL        |= DWT_CTRL_CYCCNTENA_Msk;     // запускаем счётчик
}
//**********************************************************
uint32_t DELAY_microSecCount(void){

	volatile uint32_t temp = DWT->CYCCNT;
	return (temp / TACTS_FOR_MICROSEC);
}
//**********************************************************
void DELAY_microS(uint32_t microSec){

//    uint32_t uS_count_tic = uS * TACTS_FOR_MICROSEC;// получаем кол-во тактов за 1 мкс и умножаем на наше значение
//    DWT->CYCCNT = 0U; // обнуляем счётчик
//    while(DWT->CYCCNT < uS_count_tic);

    uint32_t old = DELAY_microSecCount();
    while((DELAY_microSecCount() - old) < microSec);
}
//**********************************************************
void DELAY_milliS(uint32_t milliSec){

	DELAY_microS(milliSec * 1000);
}
//*******************************************************************************************
//*******************************************************************************************
