/*
 * Delay.c
 *
 *  Created on: 20 дек. 2020 г.
 *      Author: Zver
 */
//*******************************************************************************************
//*******************************************************************************************

#include "Delay.h"

//*******************************************************************************************
//*******************************************************************************************
static volatile uint32_t msCounter = 0;

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
void msDelay_Loop(void){

	msCounter++;
}
//**********************************************************
void msDelay(volatile uint32_t del){

	msCounter = 0;
	while(msCounter < del){__NOP();};
}
//*******************************************************************************************
//*******************************************************************************************
void DELAY_Init(void){

	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk; // разрешаем использовать счётчик
	DWT->CYCCNT       = 0;						    // сброс счетчика
	DWT->CTRL        |= DWT_CTRL_CYCCNTENA_Msk;     // запускаем счётчик
}
//**********************************************************
uint32_t DELAY_GetuSecCount(void){

	volatile uint32_t temp = DWT->CYCCNT;
	return (temp / TACTS_FOR_MICROSEC);
}
//**********************************************************
//макс. задержка 58 сек. Через 59 сек. происходит переполнение DWT->CTRL.
void DELAY_uS(uint32_t us){

	if(us > MAX_DELAY_uS) return;
    uint32_t uS_count_tic = us * TACTS_FOR_MICROSEC;// получаем кол-во тактов за 1 мкс и умножаем на наше значение
    DWT->CYCCNT = 0U; // обнуляем счётчик
    while(DWT->CYCCNT < uS_count_tic);

    //Вариант 2. Опасен переполнением счетчика DWT->CTRL.
//    uint32_t old = DELAY_microSecCount();
//    while((DELAY_microSecCount() - old) < microSec);
}
//**********************************************************
void DELAY_mS(uint32_t ms){

	DELAY_uS(ms * 1000);
}
//*******************************************************************************************
//*******************************************************************************************
