/*
 * Filters.h
 *
 *  Created on: 25 янв. 2021 г.
 *      Author: belyaev
 */

#ifndef FILTERS_H_
#define FILTERS_H_
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************



//*******************************************************************************************
//*******************************************************************************************
uint16_t Filter_Average(uint16_t inVal);  	 //усреднение по div выборкам

uint16_t Filter_LowPass(uint16_t inVal);	//Цифровой фильтр НЧ

uint16_t Filter_SMA  (uint16_t inVal);		//Алгоритм скользящего среднего (Simple Moving Average)
uint16_t Filter_SMAv2(uint16_t inVal);
uint16_t Filter_SMAv3(uint16_t inVal);
uint16_t Filter_SMAv4(uint16_t inVal);

uint16_t Filter_EMA(uint32_t inVal);		//Эспоненциальное скользящее среднее (Exponential Moving Average, EMA).
uint16_t Filter_EMAv2(uint32_t inVal);
//*******************************************************************************************
//*******************************************************************************************
#endif /* FILTERS_H_ */




