/*
 * RingBuff.c
 *
 *  Created on: 2 нояб. 2022 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "RingBuff.h"

//*******************************************************************************************
//*******************************************************************************************
static volatile uint8_t	 ringRxBuf[RING_BUFF_SIZE] = {0};
static volatile uint32_t ringRxBufTail = 0;
static volatile uint32_t ringRxBufHead = 0;
static volatile uint32_t ringRxCount   = 0;
static RingBuffFlag_t 	 ringRxFlags;

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************

//**********************************************************

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
void RING_BUFF_Init(void){

	ringRxBufTail = 0;
	ringRxBufHead = 0;
	ringRxCount   = 0;
}
//**********************************************************
//"очищает" приемный буфер
void RING_BUFF_FlushRxBuf(void){

	ringRxBufTail = 0;
	ringRxBufHead = 0;
	ringRxCount   = 0;
}
//**********************************************************
//возвращает колличество символов находящихся в приемном буфере
uint32_t RING_BUFF_GetRxCount(void){

  return ringRxCount;
}
//**********************************************************
//чтение байта из кольцевого буфера
uint8_t RING_BUFF_GetByteFromRxBuff(void){

	uint8_t byte;
	//--------------------
	if(ringRxCount > 0)//если приемный буфер не пустой
	{
		byte = ringRxBuf[ringRxBufHead];		//прочитать из него символ
		ringRxCount--;                  	//уменьшить счетчик символов
		ringRxBufHead++;                	//инкрементировать индекс головы буфера
		//if(rxBufHead == SIZE_BUF_RX) rxBufHead = 0;
		ringRxBufHead &= RING_BUFF_SIZE_MASK; //проверка на преполнение
		return byte;                 		//вернуть прочитанный символ
	}
	return 0;
}
//**********************************************************
//прерывание по завершению приема
//ISR(USART_RXC_vect){
//
//    char data = UDR;
//
//    if (rxCount < SIZE_BUF_RX)//если в буфере еще есть место
//	{
//		usartRxBuf[rxBufTail] = data;//считать символ из UDR в буфер
//		rxBufTail++;                 //увеличить индекс хвоста приемного буфера
//		if (rxBufTail == SIZE_BUF_RX) rxBufTail = 0;
//		rxCount++;                   //увеличить счетчик принятых символов
//    }
//}

//помещает символ в приемный кольцевой буфер. вызывается в прерывании по приему байта.
void RING_BUFF_PutByteToRxBuff(uint8_t byte){

    if(ringRxCount < RING_BUFF_SIZE)//если в буфере еще есть место
	{
    	//Проверка символов окончания строки и т.п.
    	if(byte == '\r') ringRxFlags.f_receivedCR = FLAG_SET;

    	ringRxBuf[ringRxBufTail] = byte;//кладем символ в буфер
    	ringRxBufTail++;           	   //увеличить индекс хвоста приемного буфера
		//if(rxBufTail == SIZE_BUF_RX) rxBufTail = 0;
    	ringRxBufTail &= RING_BUFF_SIZE_MASK;//Проверка на переполнение
    	ringRxCount++;                       //увеличить счетчик принятых символов
    }
}
//**********************************************************
RingBuffFlag_t* RING_BUFF_Flags(void){

	return &ringRxFlags;
}
//**********************************************************
//копировать принятые данные в сторонний буфер.
void RING_BUFF_CopyRxBuff(uint8_t *buff){

	while(RING_BUFF_GetRxCount())
	{
		*buff = RING_BUFF_GetByteFromRxBuff();
		buff++;
	}
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************

