/*
 * StringParser.h
 *
 *  Created on: 13 окт. 2022 г.
 *      Author: belyaev
 */

#ifndef MY_APPLICATION_STRINGPARSER_H_
#define MY_APPLICATION_STRINGPARSER_H_
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
/*вместимость приемного буфера*/
#define SIZE_RECEIVE_BUF  16

/*количество токенов*/
#define AMOUNT_PAR 2

//*******************************************************************************************
//*******************************************************************************************
/*функции парсера*/
void PARS_Init(void);
void PARS_Parser(char sym);

/*обработчик полученной строки. он определяется в другом месте*/
extern void PARS_Handler(uint8_t argc, char *argv[]);

/*дополнительные функции для работы со строками*/
uint32_t PARS_EqualStr(char *s1, char *s2);
uint32_t PARS_EqualWitchRefStr(char *refS, char *s);

uint8_t  PARS_StrToUchar(char *s);
uint32_t PARS_StrToU32(char *s);
int32_t  PARS_StrToI32(char *s);
//*******************************************************************************************
//*******************************************************************************************
#endif /* MY_APPLICATION_STRINGPARSER_H_ */





