/*
 * bootLoader.h
 *
 *  Created on: 10 февр. 2023 г.
 *      Author: belyaev
 */

#ifndef _BOOTLOADER_H_
#define _BOOTLOADER_H_
//*******************************************************************************************
//*******************************************************************************************

#include "i2c_ST.h"
#include "gpio_ST.h"
#include "flash_ST.h"
#include "iwdg_ST.h"
#include "crc_ST.h"
#include "Delay.h"

#include "GpioMCU.h"

//*******************************************************************************************
//*******************************************************************************************
//Параметры загрузчика:
//Интерфейс        			: I2C (I2C1 или I2C зависит от устройства)
//Скорость        			: 400кГц (возможно лучше 100кГц для лучшей надежности)
//Переход в режим загрузчика: при старте МК первым запускается загрузчик
//Начальный адрес  			: 0х0800 0000
//Размер	         		: 10КБ(10240 байт = 0х2800)
//							  из них 9КБ - это сам загрузчик,
//      						     1КБ - это обасть хранения состояния приложения.

#define BOOT_I2C					I2C2 		//Используемый порт I2C
#define BOOT_I2C_SPEED				400000		//Скорость I2C
#define BOOT_I2C_ADDR				0b0111000 	//Адрес загрузчика на шине I2C. такой адрес у встроенных I2C загрузчиков STM32
#define BOOT_I2C_VERSION			0x10 //0x01		//Версия загрузчика (0х01 значит версия 0.1)
#define BOOT_I2C_STM32_PID			0x410		//STM32F103CBT6(C8T6) - Medium-density - PID = 0x410
//#define BOOT_I2C_STM32_PID			0x412		//STM32F103C6T6 - Low-density - PID = 0x412
#define BOOT_I2C_TIMEOUT_MS			1000		//Таймаута ожидания запросов от Хоста. Если нет запросов к загрузчику
												//и истек таймаут, то будет переход в приложение.

#define BOOT_SIZE					(9 * 1024)	//размер загрузчика, в байтах

//Индикатор активации загрузчика
#define BOOT_INDICATOR_GPIO			GPIOB 	//GPIOA
#define BOOT_INDICATOR_PIN			9		//15

#define BOOT_INDICATOR_On()			GPIO_PIN_Low   (BOOT_INDICATOR_GPIO, BOOT_INDICATOR_PIN)
#define BOOT_INDICATOR_Off()		GPIO_PIN_High  (BOOT_INDICATOR_GPIO, BOOT_INDICATOR_PIN)
#define BOOT_INDICATOR_Toggle()		GPIO_PIN_Toggel(BOOT_INDICATOR_GPIO, BOOT_INDICATOR_PIN)
//*******************************************************************************************
//*******************************************************************************************
//Параметры приложения:
//Начальный адрес: 0х0800 0000 + 0х2800 = 0х0800 2800
//Размер         : размер_флеш_памяти_МК минус размер_загрузчика
//Условие перехода из загрузчика в приложение: таймаут (1 сек.)(если есть приложение)
//                                             по команде (команда Go загрузчика)
#define APP_PROGRAM_START_ADDR		(FLASH_BASE + BOOT_SIZE + APP_METADATA_SIZE)  //начальный адрес приложения
//**********************************
//Метаданные приложения.
//Некоторые матаданные прописываются константами в приложении. К таким константам относятся: версия методанных,
//"волшебное" число, тип приложения, и адрес векторной таблицы. Другие поля должны быть прочитаны из среды
//и введены, как DEFINES в наш Makefile.
//Некоторая информация в для метаданных может быть рассчитана только после того, как прошивка будет
//скомпилирована и слинкована. Например, длина двоичного файла, его CRC или его криптографическая подпись.
//Чтобы добавить его в шапку, мы должны отредактировать бинарник напрямую какой то внешней утилитой.

#define APP_METADATA_SIZE			(1 * 1024) 					//размер метаданных приложения
#define APP_METADATA_ADDR  			(FLASH_BASE + BOOT_SIZE) 	//адрес метаданных приложения

//**********************************
//"магическое" число обычно представляет собой константу, которая используется
//для идентификации формата файла или структуры данных.
//В этом случае каждое изображение должно иметь байты 0xcafe в первых двух байтах.
//Если число отличается - образ недействителен!

#define APP_MAGIC 0xcafe

//**********************************
//Структура метаданных приложения
typedef struct __attribute__((packed)){

	uint16_t 	metadataVersion;	//версия методанных

	//"магическое" число обычно представляет собой константу, которая используется
	//для идентификации формата файла или структуры данных.
	//В этом случае каждое изображение должно иметь байты 0xcafe в первых двух байтах.
	//Если число отличается - образ недействителен!
	uint16_t 	appMagic;			//"магическое" число

	uint8_t 	appType;			//???
	uint32_t 	appVectorAddr;		//стартовый адрес приложения
	uint32_t 	appSize;			//размер bin-файла приложения в байтах
	uint32_t 	appCrc;				//контрольная сумма bin-файла приложения
	uint8_t 	appVersion_major;	//
	uint8_t 	appVersion_minor;	//
	uint8_t 	appVersion_patch;	//
	char 		git_sha[8];			//хеш гита
	uint32_t 	reserved;			//
}appMetadata_t;
//*******************************************************************************************
//*******************************************************************************************
//Состояния исполнения команад
#define CMD_ACK					0x79		//пакет принят   (команда выполнена)
#define CMD_NACK				0x1F		//пакет отброшен (команда не выполнена)
#define CMD_BUSY				0x76		//состояние занятости BUSY (команда в процессе выполнения)
//**********************************
//Команды загрузчика - Реализованные
#define CMD_BOOT_Get			0x00		//Получает версию и разрешенные команды, поддерживаемые текущей версией загрузчика.
#define CMD_BOOT_GetVersion		0x01		//Получает версию загрузчика.
#define CMD_BOOT_GetID			0x02		//Получает идентификатор чипа
#define CMD_BOOT_RM				0x11		//Read Memory - Читает до 256 байт памяти, начиная с адреса, указанного приложением.
#define CMD_BOOT_GO				0x21		//Переходит к коду пользовательского приложения, расположенному во внутренней флэш-памяти.
#define CMD_BOOT_WM				0x31		//Write Memory - Записывает в память до 256 байт, начиная с адреса, указанного приложением.
#define CMD_BOOT_ERASE			0x44		//Стирает от одной до всех страниц или секторов флэш-памяти, используя режим двухбайтовой адресации.
#define CMD_BOOT_RP				0x82		//Readout Protect - Включает защиту от чтения.
#define CMD_BOOT_RUP			0x92		//Readout Unprotect - Отключает защиту от чтения.
#define CMD_BOOT_NS_GetCheckSum	0xA1		//No-Stretch Get Memory Checksum - Получает значение контрольной суммы CRC для области памяти.

//Нереализованные
//#define CMD_BOOT_NS_WM			0x32	//No-Stretch Write Memory - Записывает в память до 256 байт, начиная с адреса, указанного приложением, и возвращает состояние занятости во время выполнения операции.
//#define CMD_BOOT_NS_Erase			0x45	//Стирает от одной до всех страниц или секторов флэш-памяти, используя режим двухбайтовой адресации, и возвращает состояние занятости во время выполнения операции.
//#define CMD_BOOT_Special			0x50	//Общая команда, которая позволяет добавлять новые функции в зависимости от ограничений продукта, не добавляя новую команду для каждой функции.
//#define CMD_BOOT_ExtSpecial		0x51	//Extended Special - Общая команда, которая позволяет пользователю отправлять больше данных по сравнению со специальной командой.

#define CMD_BOOT_WP				0x63		//Write Protect - Включает защиту от записи для некоторых секторов.
//#define CMD_BOOT_NS_WP			0x64	//No-Stretch Write Protect - Включает защиту от записи для некоторых секторов и возвращает состояние занятости во время выполнения операции.
//
//#define CMD_BOOT_WUP				0x73	//Write Unprotect - Отключает защиту от записи для всех секторов флэш-памяти.
//#define CMD_BOOT_NS_WUP			0x74	//No-Stretch Write Unprotect - Отключает защиту от записи для всех секторов флэш-памяти и возвращает состояние занятости во время выполнения операции.
//
//#define CMD_BOOT_NS_RP			0x83	//No-Stretch Readout Protect - Включает защиту от чтения и возвращает состояние занятости во время выполнения операции.
//#define CMD_BOOT_NS_RUP			0x93	//No-Stretch Readout Unprotect - Отключает защиту от чтения и возвращает состояние занятости во время выполнения операции.
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
void BOOT_Init(void);
void BOOT_Indication(void);
void BOOT_DeinitAll(void);

uint32_t 		BOOT_AppAvailableCheck(uint32_t appAddr);
uint32_t 	 	BOOT_GetAppSize(void);
I2C_IT_State_t	BOOT_GetStateI2C(void);
void 			BOOT_GoToApp(volatile uint32_t appAddr);

void 	 BOOT_SetAppLaunch(uint32_t launch);
uint32_t BOOT_GetAppLaunch(void);

uint32_t BOOT_CalcCrc(uint32_t *addr, uint32_t size);
uint32_t BOOT_ReadAppCrc(void);
void 	 BOOT_CalcAndWriteAppCrc(void);

void BOOT_ErasePageAppState(void);

void BOOT_Loop(void);
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
#endif /* _BOOTLOADER_H_ */















