/*
 * Encoder.h
 *
 *  Created on: 5 авг. 2022 г.
 *      Author: belyaev
 */

#ifndef MCUV7_ENCODER_H_
#define MCUV7_ENCODER_H_
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define ENCODER_SPI				SPI1
#define ENCODER_RESOLUTION_BIT	16
#define ENCODER_NUM_STEP 		65536//131072 					        //количество шагов энкодера на один оборот
#define ENCODER_DEGREE_QUANT  	(float)(360.0 / ENCODER_NUM_STEP)//количество градусов в одном наге энкодера. *1000 что бы были значи после запятой
//-----------------------------------
typedef enum {
	ENCODER_NO_INIT = 0,
	ENCODER_READY,
}EncoderState_t;
//*******************************************************************************************
//*******************************************************************************************
void 	 ENCODER_Init(void);
uint32_t ENCODER_GetCode(void);

void 	 ENCODER_SetEncoderConstant(uint32_t value);
uint32_t ENCODER_GetEncoderConstant(void);
void 	 ENCODER_GetCodeEncoder(uint8_t *buf);
//*******************************************************************************************
//*******************************************************************************************
#endif /* MCUV7_ENCODER_H_ */
