/*
 * GPS.c
 *
 *  Created on: 3 окт. 2022 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "Gps.h"

//*******************************************************************************************
//*******************************************************************************************
//локальные переменные

//*******************************************************************************************
//*******************************************************************************************
void GPS_Init(void){

	//Иницияализация USART и модуля Bluetooth HC-06. Для отладки.
	USART_DMA_Init(GPS_USART, 57600);
	//Txt_Print("AT"); //Работает!! CR+LF  добовлять в конце не нужно!!!
	/* AT+BAUDx - установка скорости, где x - код скорости из таблицы,
	 * т.е. чтобы задать скорость 9600 надо подать по последовательному порту
	 * модуля команду AT+BAUD4
	 * Значение - Скорость (бод)
	 * 1 - 1200
	 * 2 - 2400
	 * 3 - 4800
	 * 4 - 9600
	 * 5 - 19200
	 * 6 - 38400
	 * 7 - 57600
	 * 8 - 115200
	 * 9 - 230400
	 */
	Txt_Print("AT+BAUD8"); //CR+LF добовлять в конце не нужно!!!
	DMAxChxStartTx(DMA1_Channel7, Txt_Buf()->buf, Txt_Buf()->bufIndex);
	Txt_Buf()->bufIndex = 0;
	DELAY_microS(50);
	USART_DMA_Init(GPS_USART, GPS_USART_BAUD_RATE);

	//Включение питания GPS.
	GPS_EN_High();
}
//**********************************************************
void GPS_PowerControl(uint32_t state){

	if(state == GPS_POWER_ON)
	{
		GPS_EN_High(); //Вкл.
		USART_DMA_Enable(GPS_USART);
	}
	else
	{
		GPS_EN_Low();  //Откл.
		USART_DMA_Disable(GPS_USART);
	}
}
//**********************************************************


//*******************************************************************************************
//*******************************************************************************************







