/*
 * Power.h
 *
 *  Created on: 30 авг. 2022 г.
 *      Author: belyaev
 */

#ifndef MCUV7_POWER_H
#define MCUV7_POWER_H
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define ADC_DC_IN_DIV_CH		8		//Канал АЦП
#define DIVIDER_HIGH_RESISTER	10000	//Сопротивление верхнего резистора делителя, в Омах
#define DIVIDER_LOW_RESISTER	1000	//Сопротивление нижнего резистора делителя, в Омах
#define DIVISION_FACTOR		    ((DIVIDER_HIGH_RESISTER/DIVIDER_LOW_RESISTER) + 1)//коэффициент деления елителя

#define BATTERY_VOLTAGE_MIN		10800	//Минимально напряжение питания, в мВ
#define BATTERY_VOLTAGE_WARNING	12000	//Напряжение при котором нужно обратить внимание на заряд АКБ, в мВ.
//Кнопка включения питания
#define MCU_PWR_BUTTON_GPIO	GPIOB
#define MCU_PWR_BUTTON_PIN	3

typedef enum{
	RELEASE = 0, //отпускание кнопки
	PRESS,       //нажатие на кнопку
//	CLICK,		 //клик по кнопке
//	LONG_PRESS,	 //удержание дольше timeout - длительное нажатие
//	HOLD,		 //удержание кнопки
}PwrButtonState_t;
//**********************************
//Флаги питания
typedef struct{
	uint32_t 	f_PowerOff   	 : 1; //флаг отключения питания. выставляется после нажатия кнопки питания.
	uint32_t 	f_BatteryWarning : 1; //Напряжение АКБ ниже 12В
	uint32_t 	f_BatteryLow 	 : 1; //Напряжение АКБ ниже минимально допустимого (10,8В)
	uint32_t	dummy	     	 : 32;
}PowerFlag_t;
//*******************************************************************************************
//*******************************************************************************************
void	 	     POWER_Init(void);
uint32_t 	     POWER_SupplyVoltage(void);
PowerFlag_t*     POWER_Flags(void);
PwrButtonState_t POWER_PwrButton(void);

//*******************************************************************************************
//*******************************************************************************************
#endif /* MCUV7_POWER_H_ */
