/*
 * Protocol_I2C.h
 *
 *  Created on: 22 авг. 2022 г.
 *      Author: belyaev
 */
#ifndef MCUV7_PROTOCOL_I2C_H
#define MCUV7_PROTOCOL_I2C_H
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define PROTOCOL_I2C_REQUEST_TIMEOUT_mS		1000	//

//****************************************************
//Структура запроса.
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef struct{
	uint8_t  CmdCode;    	// Код команды.
	uint8_t  Count;       	// Размер блока.
	uint8_t	 Payload[62];	// Данные
}MCU_Request_t;
#pragma pack(pop)//вернули предыдущую настройку.
//****************************************************
//Структура ответа.
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef struct{
	uint8_t  Count;       	// Размер блока.
	uint8_t  CmdCode;    	// Код команды.
	uint8_t	 Payload[62];	// Данные
}MCU_Response_t;
#pragma pack(pop)//вернули предыдущую настройку.
//****************************************************
//флаги приема команд.
typedef struct{
	uint32_t	f_cmdMotorTorqueCtrl   : 1; //пришла команда Вкл./Откл. момента удержания ШД.
	uint32_t	f_cmdSetTargetPosition : 1; //пришла команда на запуск вращения.
	uint32_t	dummy	     	 	   : 30;
}ProtocolCmdFlag_t;
//*******************************************************************************************
//*******************************************************************************************
void 	 PROTOCOL_I2C_Init(void);
void 	 PROTOCOL_I2C_IncTimeoutAndResetI2c(void);
uint32_t PROTOCOL_I2C_GetResetCount(void);

//*******************************************************************************************
//*******************************************************************************************
#endif /* MCUV7_PROTOCOL_I2C_H */



