/*
 * 	adcST.h
 *
 *  Created on:
 *      Author: belyaev
 */

#ifndef _ADC_ST_H
#define _ADC_ST_H
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define ADC_V_REF		3265U 	//Опорное напряжение
#define ADC_RESOLUTION	4096U 	//
#define ADC_SCALE		1024U	//
#define ADC_QUANT_uV	(uint32_t)((ADC_V_REF * ADC_SCALE + ADC_RESOLUTION/2) / ADC_RESOLUTION)

#define ADC_MEAS_NUM	16     	//Количество измерений для усреднения
#define ADC_MEAS_SHIFT	4      	//Количество сдвигов для деления
//--------------------


//*******************************************************************************************
//*******************************************************************************************
//Аппатартный уровень.
void     ADC_Init(void);
uint16_t ADC_GetMeas_mV(uint32_t adcCh);

uint32_t ADC_GetRegDR(ADC_TypeDef *adc);
uint32_t ADC_GetRegJDRx(ADC_TypeDef *adc, uint32_t ch);
//*******************************************************************************************
//*******************************************************************************************
#endif /*_adc_ST_HH*/






