/*
 * flash_ST.c
 *
 *  Created on: 9 авг. 2022 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "flash_ST.h"

//*******************************************************************************************
//*******************************************************************************************



//*******************************************************************************************
//*******************************************************************************************
//Блокировка flash.
void STM32_Flash_Lock(void){

  FLASH->CR |= FLASH_CR_LOCK;
}
//*****************************************************************************
//Разблокировка работы с flash.
void STM32_Flash_Unlock(void){

  FLASH->KEYR = 0x45670123;
  FLASH->KEYR = 0xCDEF89AB;
}
//*****************************************************************************
//Стирание страницы flash.
//Перед записью необходимо стереть данные по нужным адресам,
//это особенность флеша.
//pageAddress - любой адрес, принадлежащий стираемой странице
void STM32_Flash_ErasePage(uint32_t pageAddress){

	while(FLASH->SR & FLASH_SR_BSY){};                     //Ждем окончания работы с памятю.
	if(FLASH->SR & FLASH_SR_EOP) FLASH->SR = FLASH_SR_EOP; //Сбрасывается бит EOP записью в него единицы.
	FLASH->CR |= FLASH_CR_PER;  //стирания страницы.
	FLASH->AR  = pageAddress;   //адрес стираемой страницы.
	FLASH->CR |= FLASH_CR_STRT; //Запуск выбранной операции
	while (!(FLASH->SR & FLASH_SR_EOP));
	FLASH->SR  =  FLASH_SR_EOP;
	FLASH->CR &= ~FLASH_CR_PER;
}
//*****************************************************************************
void STM32_Flash_WriteWord(uint32_t word, uint32_t address){

	while(FLASH->SR & FLASH_SR_BSY){};                     //Ждем окончания работы с памятю.
	if(FLASH->SR & FLASH_SR_EOP) FLASH->SR = FLASH_SR_EOP; //Сбрасывается бит EOP записью в него единицы.
	FLASH->CR |= FLASH_CR_PG;                              //разрешение зиписи во флеш.

	*(volatile unsigned short*)address = (uint16_t)word;
	while(!(FLASH->SR & FLASH_SR_EOP)){};
	FLASH->SR = FLASH_SR_EOP;

	*(volatile unsigned short*)(address + 2) = (uint16_t)(word >> 16);
	while(!(FLASH->SR & FLASH_SR_EOP)){};
	FLASH->SR = FLASH_SR_EOP;
	FLASH->CR &= ~(FLASH_CR_PG);
}
//*****************************************************************************
//Чтения 32-хбитного слова из FLASH.
uint32_t STM32_Flash_ReadWord(uint32_t address){

	return (*(__IO uint32_t*)address);
}
//*******************************************************************************************
//*******************************************************************************************







