/*
 * 	main.c
 *
 *  Created on: 27 апреля 2023 года.
 *  Autho     : Беляев А.А.
 *
 *	Описание  : I2C Boot Loader для платы MCUv7
 *
 */
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
//Метаданные приложения.
//Некоторые матаданные прописываются константами в приложении. К таким константам относятся: версия методанных,
//"волшебное" число, тип приложения, и адрес векторной таблицы. Другие поля должны быть прочитаны из среды
//и введены, как DEFINES в наш Makefile.
//Некоторая информация в для метаданных может быть рассчитана только после того, как прошивка будет
//скомпилирована и слинкована. Например, длина двоичного файла, его CRC или его криптографическая подпись.
//Чтобы добавить его в шапку, мы должны отредактировать бинарник напрямую какой то внешней утилитой.

const appMetadata_t *const appMetadata = (appMetadata_t*)0x08002400;

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
int main(void){

	__disable_irq();
	//BOOT_DeinitAll();
	STM32_Clock_Init();
	GPIO_Init();
	DELAY_Init();
	BOOT_Init();
	SharedMemory_Init();
	__enable_irq();
	//***********************************************
	//Включение питания платы MCUv7
	GPIO_MCU_Init();
	MCU_POWER_ON();

	//ждем отпускания кнопки
	while(GPIO_MCU_GetPwrButton() == 0);
	//***********************************************
	//Мигнем три раза - индикация запуска загрузчика.
	BOOT_Indication();

	//-------------------
	//Приложение хочет обновиться.
	//Приложение выставило флаг в ОЗУ и перезагрузило МК.
	if(SharedMemory_GetFlags() & DFU_REQUESTED_FLAG)
	{
		SharedMemory_ClearFlag(DFU_REQUESTED_FLAG);	//сброс влага запуска загрузчика
		goto BOOT;									//переход в загрузчик
	}
	//-------------------
	//Проверим "магическое" число приложения.
	//"Магическое" число устанавливается при заливке образа приложения.
	if(appMetadata->appMagic != APP_MAGIC)
	{
		goto BOOT;	//переход в загрузчик
	}
	//-------------------
	//TODO ... Разобраться со сторожевым таймером

	//TODO ... Проверка вершины стека приложения.

	//TODO ... Подсчитаем сколько байт занимает приложение.

	//TODO ... Проверим crc приложения. CRC лежит в метаданных приложения.

	//-------------------
	//Переходим в приложение в случае:
	//отстутствие запросов к загрузчику по шине I2C;
	//по истечении таймаута (1сек.).
	uint32_t micros = DELAY_microSecCount();
	while(BOOT_GetStateI2C() != I2C_IT_STATE_ADDR_WR)	//нет запросов от хоста по I2C
	{
		//Отсчет таймаута
		if((DELAY_microSecCount() - micros) >= (BOOT_I2C_TIMEOUT_MS*1000))
		{
			BOOT_GoToApp(APP_PROGRAM_START_ADDR);//Переход в приложение
			goto BOOT;							 //Если ошибка при переходе в приложение, то перходим в загрузчик.
		}
	}
	//***********************************************
	BOOT:
	//IWDG_Init(3000); 	//Период сторожевого таймера 3 сек.
						//Сброс сторожевого таймера в ф-ии _waitEndRx() модуля bootLoader.c
	while(1)
	{
		//Загрузчик
		BOOT_Loop();

		//Отключение питания MCUv7 по нажатию на кнопку в ф-ии _waitEndRx() модуля bootLoader.c
	}
	//***********************************************
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
//void SysTick_IT_Handler(void){
//
//}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************






