/*
 * sharedMemory.h
 *
 *  Created on: 29 мар. 2023 г.
 *      Author: belyaev
 */

#ifndef SHARED_MEMORY_H_
#define SHARED_MEMORY_H_
//*******************************************************************************************
//*******************************************************************************************

#include "stdint.h"
#include "string.h"

//*******************************************************************************************
//*******************************************************************************************
typedef struct __attribute__((packed)){
    uint32_t 	magic;
    uint32_t 	flags;
    uint32_t	boot_counter;
}sharedMemory_t;
//*********************************
//Флаги
#define	DFU_REQUESTED_FLAG (uint32_t)(1 << 0)

//*******************************************************************************************
//*******************************************************************************************
void 		SharedMemory_Init(void);

uint32_t 	SharedMemory_GetFlags(void);
void 		SharedMemory_SetFlag(uint32_t flag);
void 		SharedMemory_ClearFlag(uint32_t flag);

void 		SharedMemory_IncrementBootCounter(void);
void 		SharedMemory_ClearBootCounter(void);
uint32_t 	SharedMemory_GetBootCounter(void);
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
#endif /* FOR_BOOTLOADER_METADATA_H_ */




















