/*
 * 	adcST.h
 *
 *  Created on:
 *      Author: belyaev
 */

#ifndef _ADC_ST_H
#define _ADC_ST_H
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define ADC_REF			  3255U //Опорное напряжение
#define ADC_RESOLUTION	  4096U
#define ADC_SCALE		  1024U
#define ADC_QUANT		  ((ADC_REF * ADC_SCALE + ADC_RESOLUTION/2) / ADC_RESOLUTION)

#define AdcMeasQuantity		16     //Количество измерений для усреднения
#define AdcMeasShiftDev		4      //Количество сдвигов для деления
//--------------------


//*******************************************************************************************
//*******************************************************************************************
//Аппатартный уровень.
void     ADC_Init(void);
uint32_t ADC_GetMeas(uint32_t channel);
uint16_t ADC_GetRegDR(ADC_TypeDef *adc);
uint16_t ADC_GetRegJDRx(ADC_TypeDef *adc, uint8_t ch);
//*******************************************************************************************
//*******************************************************************************************
#endif /*_adc_ST_HH*/






