/*
 * flash_ST.c
 *
 *  Created on: 9 авг. 2022 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "flash_ST.h"

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
// Function    : _flash_Ready()
// Description : готовность к работу флеш памяти
//				 BSY(Busy) — устанавливается во время операций записи/стирания и сбрасывается
//				 по окончании или возникновении ошибки.
// Parameters  :
// RetVal      : 1 - память готова к работе ; 0 - память занята ( производятся операций записи/стирания)
//*****************************************
static uint32_t _flash_Ready(void){

	return !(FLASH->SR & FLASH_SR_BSY);
}
//*****************************************************************************
// Function    : _flash_CheckEOP()
// Description : EOP(End of operation) — устанавливается аппаратно,
//				 при успешном завершении операции записи/стирания.
// Parameters  :
// RetVal      : 1 - успешное завершение операции записи/стирания; 0 - ошибка
//*****************************************
static uint32_t _flash_CheckEOP(void){

	if(FLASH->SR & FLASH_SR_EOP)
	{
		FLASH->SR |= FLASH_SR_EOP;
		return 1;
	}
	return 0;
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
// Function    : STM32_Flash_Lock()
// Description : Блокировка flash от записи/стирания
// Parameters  :
// RetVal      :
//*****************************************
void STM32_Flash_Lock(void){

	FLASH->CR |= FLASH_CR_LOCK;
}
//*****************************************************************************
// Function    : STM32_Flash_Unlock()
// Description : Разблокировка flash для записи/стирания
// Parameters  :
// RetVal      :
//*****************************************
void STM32_Flash_Unlock(void){

	FLASH->KEYR = FLASH_KEY1;
	FLASH->KEYR = FLASH_KEY2;
}
//*****************************************************************************
// Function    : STM32_Flash_ErasePage()
// Description : Стирание одной страницы flash (вся страница заполняется 0xFF)
// Parameters  : pageAddress - адрес стираемой страницы. Адрес и размер страницы
//				 необходимо уточнить в документации на МК.
// RetVal      : 1 - идет стирание страницы; 0 - стирание страницы завершено
//*****************************************
void STM32_Flash_ErasePage(uint32_t pageAddress){

	while(!_flash_Ready()); 	//Ожидаем готовности флеша к записи
	_flash_CheckEOP();	    	//Сбрасывается бит EOP записью в него единицы.

	FLASH->CR |= FLASH_CR_PER;  //Устанавливаем бит стирания одной страницы
	FLASH->AR  = pageAddress;   //адрес стираемой страницы.
	FLASH->CR |= FLASH_CR_STRT; //Запускаем стирание

	while(!_flash_CheckEOP());	//Ждем завершения стирания

	FLASH->CR &= ~FLASH_CR_PER;	//Сбрасываем бит стирания одной страницы
}
//*****************************************************************************
// Function    : STM32_Flash_WriteWord()
// Description : Запись 4-х байтов во flash.
//				 Перед записью необходимо стереть данные по нужным адресам,
//				 Программировать память можно только 16 битными словами (uint16_t).
//				 Адрес, куда производится запись, также должен быть выровнен на 2 байта.
// Parameters  : address - адрес во flash, куда хотим произвести запись. Должен быть выровнен на 2 байта.
//				 data    - 4-хбайтовое число, которое хотим записать
// RetVal      :
//*****************************************
void STM32_Flash_WriteWord(uint32_t address, uint32_t data){

	while(!_flash_Ready()); 	//Ожидаем готовности флеша к записи
	_flash_CheckEOP();	    	//Сбрасывается бит EOP записью в него единицы.

	FLASH->CR |= FLASH_CR_PG;					//разрешение зиписи во флеш.

	*(__IO uint16_t*)address = (uint16_t)data;	//запишем МЛАДШИЕ 2 байта
	while(!_flash_CheckEOP());					//Ждем завершения стирания

	*(__IO uint16_t*)(address + 2) = (uint16_t)(data >> 16);//запишем СТАРШИЕ 2 байта
	while(!_flash_CheckEOP());		//Ждем завершения стирания

	FLASH->CR &= ~FLASH_CR_PG;	//Запрет записи во флэш.
}
//*****************************************************************************
// Function    : STM32_Flash_WriteHalfWord()
// Description : Запись 2-х байтов во flash.
//				 Перед записью необходимо стереть данные по нужным адресам,
//				 Программировать память можно только 16 битными словами (uint16_t).
//				 Адрес, куда производится запись, также должен быть выровнен на 2 байта.
// Parameters  : address - адрес во flash, куда хотим произвести запись. Должен быть выровнен по 2-м.
//				 data    - 2-хбайтовое число, которое хотим записать
// RetVal      :
//*****************************************
void STM32_Flash_WriteHalfWord(uint32_t address, uint16_t data){

	while(!_flash_Ready()); 	//Ожидаем готовности флеша к записи
	_flash_CheckEOP();	    	//Сбрасывается бит EOP записью в него единицы.

	FLASH->CR |= FLASH_CR_PG;	//разрешение зиписи во флеш.

	*(__IO uint16_t*)address = data;	//запишем МЛАДШИЕ 2 байта
	while(!_flash_CheckEOP());			//Ждем завершения стирания

	FLASH->CR &= ~FLASH_CR_PG;	//Запрет записи во флэш.
}
//*****************************************************************************
// Function    : STM32_Flash_WriteBuf()
// Description : Запись буфера Src во flash, начиная с адреса Dst.
//				 Перед записью необходимо стереть данные по нужным адресам,
//				 Программировать память можно только 16 битными словами (uint16_t).
//				 Адрес, куда производится запись, также должен быть выровнен на 2 байта.
// Parameters  : Src  - источник данных   - указатель на буфер, который хотим записать во flash.
//				 Dst  - получатель данных - адрес во flash, куда хотим произвести запись. Должен быть выровнен по 2-м.
//				 size - кол-во байт на запись. Должно быть кратным 2-м.
// RetVal      :
//*****************************************
void STM32_Flash_WriteBuf(void* Src, void* Dst, uint32_t size){

		     uint16_t* src = Src;
	volatile uint16_t* dst = Dst;
	//-----------------------
	while(!_flash_Ready()); 	//Ожидаем готовности флеша к записи
	_flash_CheckEOP();	    	//Сбрасывается бит EOP записью в него единицы.

	FLASH->CR |= FLASH_CR_PG;	//разрешение зиписи во флеш.

	while(size)
	{
		*dst = *src;			//пишем во флэш
		while(!_flash_Ready());	//Ждем завершения записи

		//Проверка: если не совпадает то что записываем и то что записаловь, то выходим.
		//if(*dst != *src) goto EndPrg;

		dst++;
		src++;
		size = size - 2; //-2 т.к. пишем по 2 байта
	}
	//EndPrg:
	FLASH->CR &= ~FLASH_CR_PG; //Запрет записи во флэш.
}
//*****************************************************************************
// Function    : STM32_Flash_ReadWord()
// Description : чтения 32-хбитного слова из FLASH.
// Parameters  : addr - адрес во флеш памяти, из которого будем читать данные.
// RetVal      : 4-хбайтное значение, прочитаное из флеш памяти.
//*****************************************
uint32_t STM32_Flash_ReadWord(uint32_t addr){

	return (*(__IO uint32_t*)addr);// __IO тоже самое что и volatile
}
//*****************************************************************************
// Function    : STM32_Flash_ReadBufU8()
// Description : чтение данных (по 1-му байту) из FLASH-памяти в буфер
// Parameters  : Src  - адрес во влеш памяти, из которого будем читать данные.
//				 Dst  - указатель на буфер, в который будем складывать прочитанные данные
//				 size - сколько байт хотим прочитать.
// RetVal      :
//*****************************************
void STM32_Flash_ReadBufU8(void* Src, void* Dst, uint32_t size){

	volatile uint8_t* src = Src;
    	 	 uint8_t* dst = Dst;
	//-----------------------
	while(size)
	{
		*dst++ = *src++;
		size--;
	}
}
//*****************************************************************************
// Function    : STM32_Flash_ReadBufU32()
// Description : чтение данных (по 4-ре байта) из FLASH-памяти в буфер
// Parameters  : Src  - адрес во влеш памяти, из которого будем читать данные. Должен быть кратен 4-м.
//				 Dst  - указатель на буфер, в который будем складывать данные
//				 size - сколько байт хотим прочитать. Должно быть кратно 4-м.
// RetVal      :
//*****************************************
void STM32_Flash_ReadBufU32(void* Src, void* Dst, uint32_t size){

	volatile uint32_t* src = Src;
    		 uint32_t* dst = Dst;
	//-----------------------
    size /= 4;
	while(size)
	{
		*dst++ = *src++;
		size--;
	}
}
//*****************************************************************************
// Function    : STM32_Flash_GetReadOutProtectionStatus()
// Description :
// Parameters  :
// RetVal      : 1 - включена защита от чтения
//*****************************************
uint32_t STM32_Flash_GetReadOutProtectionStatus(void){

	if(FLASH->OBR & FLASH_OBR_RDPRT) return 1;
	return 0;
}

//*****************************************************************************
// Function    : STM32_Flash_ReadOutProtection()
// Description : Вкл./Откл. защиты от чтения
// Parameters  : state - FLASH_RDO_ENABLE / FLASH_RDO_DISABLE
// RetVal      :
//*****************************************
FlashStatus_t STM32_Flash_ReadOutProtection(uint32_t state){

	/* Authorizes the small information block programming */
	FLASH->OPTKEYR = FLASH_KEY1;
	FLASH->OPTKEYR = FLASH_KEY2;
	FLASH->CR |= FLASH_CR_OPTER;	//Option Byte Erase
	FLASH->CR |= FLASH_CR_STRT;		//Start

	/* Wait for last operation to be completed */
	while(!_flash_Ready()); 	//Ожидаем завершеия операции

	/* if the erase operation is completed, disable the OPTER Bit */
	FLASH->CR &= ~FLASH_CR_OPTER;

	/* Enable the Option Bytes Programming operation */
	FLASH->CR |= FLASH_CR_OPTPG;	//Option Byte Programming

	if(state == FLASH_RDO_ENABLE) OB->RDP = 0x00;				//
	else	  					  OB->RDP = (uint16_t)0x00A5;	//

	/* Wait for last operation to be completed */
	while(!_flash_Ready()); 	//Ожидаем завершеия операции

	/* if the program operation is completed, disable the OPTPG Bit */
	FLASH->CR &= ~FLASH_CR_OPTPG;

	return FLASH_COMPLETE;
}
//*****************************************************************************
// Function    : STM32_Flash_GetWriteProtectionOptionByte()
// Description :
// Parameters  :
// RetVal      :
//*****************************************
uint32_t STM32_Flash_GetWriteProtectionOptionByte(void){

	/* Return the Flash write protection Register value */
	return (uint32_t)(FLASH->WRPR);
}
//*****************************************************************************
// Function    : STM32_Flash_EnableWriteProtection()
// Description :
// Parameters  :
// RetVal      :
//*****************************************
FlashStatus_t STM32_Flash_EnableWriteProtection(uint32_t flashPages){

	return FLASH_ERROR_PG;
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************


//*****************************************************************************


//*****************************************************************************


//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************



















