/*
 *  sys_tick_ST.c
 *
 *  Created on:
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "sys_tick_ST.h"

//*******************************************************************************************
//*******************************************************************************************
//Инициализация системного таймера SysTick.
void SYS_TICK_Init(void){

	SysTick->LOAD = TimerTick;	//Загрузка значения.
	SysTick->VAL  = TimerTick;	//Обнуление таймера. 
                                //При записи любого значения этот регист обнуляется, с обнулением флага COUNTFLAG.
	/* Set SysTick interrupt preemption priority to 3 */
	//NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));

	SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | //Тактирование частотой процессора.
					SysTick_CTRL_TICKINT_Msk; //   | //Рразрешение прерывания.
					//SysTick_CTRL_ENABLE_Msk;     //Резрешение таймеру считать.
}
//**********************************************************
void SYS_TICK_Control(uint32_t state){

	if(state) SysTick->CTRL |=  SysTick_CTRL_ENABLE_Msk; //Вкл. таймера.
	else 	  SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk; //Откл. таймера.
}
//*******************************************************************************************
//*******************************************************************************************




