/******************************************************************************************
 * За основу взят планировщик задач с сайта ChipEnable.ru                                 *
 * http://chipenable.ru/index.php/programming-avr/item/110-planirovschik.html             *
 *                                                                                        *
 * Доработал Шибанов Владимир aka KontAr                                                  *
 * Дата: 26.03.2014                                                                       *
 *                                                                                        *
 * Изменения:                                                                             *
 * - добавлен однократный вызов задачи                                                    *
 * - добавлено удаление задачи по имени                                                   *
 * - при повторном добавлении задачи обновляются ее переменные                            *
 * - добавлен указатель на "хвост" списка                                                 *
 * - функции РТОС скорректированы с учетом "хвоста"
 *
 * Доработки Беляева А.А.:
 * - инициализация и разрешение прерывания системного таймера производится в RTOS_Init;
 * - добавлена ф-ия RTOS_SysTickITHandler, вызывается в прерывании системного таймера
 * 	 в файле stm32f10x_it.с;
 * - добавлена ф-ия обратного вызова RTOS_SysTickCallback для использования прерывания
 * 	 системного таймера в основном приложении;
 * - ф-я _rtos_TimerServiceLoop сделана статической.
 */

#ifndef RTOS_H
#define RTOS_H
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define MAX_TASKS	10 // Максимальное количество задач

//************************************
//Состяния задачи.
typedef enum{
	TASK_STOP = 0,
	TASK_RUN,
	
//	NoInit, 	//резерв
//	Active, 	//резерв
//	Suspend, 	//резерв
//	Wait, 		//резерв
//	Semaphore,	//резерв
}taskState_t;
//************************************
// Структура задачи
typedef struct{
   void(*pFunc)(void);	// указатель на функцию
   uint32_t    delay;	// задержка перед первым запуском задачи
   uint32_t    period;	// период запуска задачи
   taskState_t state;   // состяние задачи.
}task_t;
//*******************************************************************************************
//*******************************************************************************************
// Прототипы фукнций
void 	 RTOS_Init(void);
void     RTOS_SetTask(void(*taskFunc)(void), uint32_t taskDelay, uint32_t taskPeriod);
void     RTOS_DeleteTask(void(*taskFunc)(void));
void     RTOS_DispatchLoop(void);
uint32_t RTOS_GetTickCount(void);

void 	RTOS_SysTickCallback(void);
void 	RTOS_SysTickITHandler(void);
//*******************************************************************************************
//*******************************************************************************************
#endif









